Repository: zouhayral/gps_tracker_app_version1
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: GPS Tracker
ar: تتبع GPS

# settingsTitle
source: Settings
ar: الإعدادات

# reportsTitle
source: Reports & Statistics
ar: التقارير والإحصائيات

# reportsSubtitle
source: View trips, speeds, and distances
ar: عرض الرحلات والسرعات والمسافات

source: Period
ar: الفترة

source: Device
ar: جهاز

source: Distance
ar: المسافة

source: Avg Speed
ar: متوسط السرعة

source: Max Speed
ar: أقصى سرعة

source: Trips
ar: الرحلات

source: Language
ar: اللغة

# languageSubtitle
source: Select app language
ar: اختر لغة التطبيق

# noData
source: No data available
ar: لا توجد بيانات متاحة

source: Refresh
ar: تحديث

source: Export & Share Report
ar: تصدير ومشاركة التقرير

# selectDevice
source: Select a device
ar: اختر جهازًا

source: No devices available
ar: لا توجد أجهزة متاحة

# pleaseSelectDevice
source: Please select a device
ar: الرجاء اختيار جهاز

# noDeviceSelected
source: No device is currently selected
ar: لم يتم اختيار أي جهاز حاليًا

source: Loading statistics...
ar: جارٍ تحميل الإحصائيات...

source: Loading error
ar: خطأ في التحميل

source: Retry
ar: إعادة المحاولة

# noTripsRecorded
source: No trips recorded for this period
ar: لم يتم تسجيل رحلات لهذه الفترة

source: Day
ar: يوم

source: Week
ar: أسبوع

source: Month
ar: شهر

source: Custom
ar: مخصص

source: Edit period
ar: تعديل الفترة

source: Generating PDF...
ar: جارٍ إنشاء ملف PDF...

source: Report shared successfully
ar: تم مشاركة التقرير بنجاح

source: Error sharing report
ar: خطأ في مشاركة التقرير

source: No data to export
ar: لا توجد بيانات للتصدير

source: Fuel Used
ar: الوقود المستخدم

source: Speed Evolution
ar: تطور السرعة

source: Trip Distribution
ar: توزيع الرحلات

source: Period Summary
ar: ملخص الفترة

source: Start
ar: البداية

source: End
ar: النهاية

source: Duration
ar: المدة

source: Account
ar: الحساب

source: Not signed in
ar: غير مسجل الدخول

source: Notifications
ar: الإشعارات

# notificationsSubtitle
source: Turn off to stop receiving live alerts. You can still view them in the Alerts tab.
ar: قم بإيقاف التشغيل لإيقاف تلقي التنبيهات المباشرة. يمكنك عرضها في علامة التبويب التنبيهات.

source: Analytics & Reports
ar: التحليلات والتقارير

source: Geofences
ar: السياجات الجغرافية

source: Manage Geofences
ar: إدارة السياجات الجغرافية

# manageGeofencesSubtitle
source: Create, edit, or configure geofence settings
ar: إنشاء أو تعديل أو تكوين إعدادات السياج الجغرافي

source: Language & Developer Tools
ar: اللغة وأدوات المطور

# currentLanguage
source: Current
ar: الحالي

source: Select Language
ar: اختر اللغة

source: Locale Test
ar: اختبار اللغة

# localeTestSubtitle
source: Verify localization configuration
ar: التحقق من تكوين اللغة

source: Logout
ar: تسجيل الخروج

source: Logged out
ar: تم تسجيل الخروج

source: Cancel
ar: إلغاء

source: Time
ar: الوقت

source: Speed
ar: السرعة

source: Number of trips
ar: عدد الرحلات

# tripCount
source: {count, plural, =0{No trips} =1{1 trip} other{{count} trips}}
ar: {count, plural, =0{لا توجد رحلات} =1{رحلة واحدة} other{{count} رحلات}}

source: Charts not included
ar: الرسوم البيانية غير مشمولة

source: Generated on
ar: تم الإنشاء في

source: Main Statistics
ar: الإحصائيات الرئيسية

source: Metric
ar: المقياس

source: Value
ar: القيمة

source: Period Details
ar: تفاصيل الفترة

# mapTitle
source: Map
ar: الخريطة

# tripsTitle
source: Trips
ar: الرحلات

# notificationsTitle
source: Alerts
ar: التنبيهات

source: All Devices
ar: جميع الأجهزة

source: No update yet
ar: لا يوجد تحديث بعد

source: Updated
ar: تم التحديث

source: Refresh data
ar: تحديث البيانات

source: Data refreshed successfully
ar: تم تحديث البيانات بنجاح

source: Refresh failed
ar: فشل التحديث

source: Map layer
ar: طبقة الخريطة

source: Open in Maps
ar: فتح في الخرائط

# noValidCoordinates
source: No valid coordinates available for this device
ar: لا توجد إحداثيات صالحة متاحة لهذا الجهاز

source: Failed to open maps
ar: فشل فتح الخرائط

# failedToLoadDevices
source: Failed to load devices for map
ar: فشل تحميل الأجهزة للخريطة

source: Loading map tiles...
ar: جاري تحميل بلاطات الخريطة...

source: Loading fleet data...
ar: جاري تحميل بيانات الأسطول...

source: Failed to load fleet data
ar: فشل تحميل بيانات الأسطول

source: Live Tracking
ar: تتبع مباشر

source: Center Map
ar: توسيط الخريطة

source: Device Offline
ar: الجهاز غير متصل

source: No Devices Found
ar: لم يتم العثور على أجهزة

# engineAndMovement
source: Engine & Movement
ar: المحرك والحركة

source: Engine
ar: المحرك

source: Last Location
ar: آخر موقع

source: Coordinates
ar: الإحداثيات

# noLocationData
source: No location data available
ar: لا توجد بيانات موقع متاحة

source: devices selected
ar: أجهزة محددة

source: Online
ar: متصل

source: Offline
ar: غير متصل

source: Unknown
ar: غير معروف

source: more
ar: المزيد

source: Filter Your Trips
ar: تصفية رحلاتك

# filterDescription
source: Select devices and date range to view trips
ar: حدد الأجهزة ونطاق التاريخ لعرض الرحلات

source: Apply Filter
ar: تطبيق الفلتر

# quickAllDevices
source: Quick: All Devices (24h)
ar: سريع: جميع الأجهزة (24 ساعة)

source: No trips found
ar: لم يتم العثور على رحلات

# filterTripsTitle
source: Filter Trips
ar: تصفية الرحلات

source: Date Range
ar: نطاق التاريخ

source: Devices
ar: الأجهزة

# devicesAvailable
source: {count} devices available
ar: {count} أجهزة متاحة

source: Trip Summary
ar: ملخص الرحلات

source: View Details
ar: عرض التفاصيل

# alertsTitle
source: Alerts
ar: التنبيهات

# noAlerts
source: No alerts yet
ar: لا توجد تنبيهات بعد

# markAllRead
source: Mark all as read
ar: تحديد الكل كمقروء

source: Clear all
ar: مسح الكل

source: Refreshing alerts...
ar: جاري تحديث التنبيهات...

source: Failed to load alerts
ar: فشل تحميل التنبيهات

# newEventsWillAppear
source: New events will appear here
ar: ستظهر الأحداث الجديدة هنا

source: Mark all
ar: تحديد الكل

source: Delete all
ar: حذف الكل

source: Delete all notifications?
ar: حذف جميع الإشعارات؟

# deleteAllNotificationsConfirm
source: This will permanently remove all notifications from this device.
ar: سيؤدي هذا إلى حذف جميع الإشعارات من هذا الجهاز بشكل دائم.

source: All notifications deleted
ar: تم حذف جميع الإشعارات

source: Delete
ar: حذف

source: Close
ar: إغلاق

source: Message
ar: الرسالة

source: Device ID
ar: معرف الجهاز

source: Severity
ar: الخطورة

source: Ignition On
ar: تم تشغيل الإشعال

source: Ignition Off
ar: تم إيقاف الإشعال

source: Device Online
ar: الجهاز متصل

# geofenceEnter
source: Geofence Entered
ar: دخول المنطقة الجغرافية

# geofenceExit
source: Geofence Exited
ar: خروج من المنطقة الجغرافية

source: Alarm
ar: إنذار

source: Overspeed
ar: تجاوز السرعة

source: Maintenance Due
ar: صيانة مطلوبة

source: Device Moving
ar: الجهاز يتحرك

source: Device Stopped
ar: الجهاز متوقف

source: Speed alert
ar: تنبيه السرعة

source: Vehicle stopped
ar: تم إيقاف المركبة

source: Vehicle moving
ar: المركبة تتحرك

source: Unknown Device
ar: جهاز غير معروف

source: Alert Details
ar: تفاصيل التنبيه

source: Triggered at
ar: تم التفعيل في

source: Type
ar: النوع

source: Location
ar: الموقع

source: Basic Information
ar: المعلومات الأساسية

source: Name
ar: الاسم

source: Description
ar: الوصف

source: optional
ar: اختياري

# allDevicesLabel
source: All Devices
ar: جميع الأجهزة

source: Create Geofence
ar: إنشاء سياج جغرافي

source: Save
ar: حفظ

source: Triggers
ar: المشغلات

source: Polygon
ar: مضلع

source: Circle
ar: دائرة

source: Draw Boundary
ar: رسم الحدود

source: Use Current Location
ar: استخدام الموقع الحالي

source: Radius
ar: نصف القطر

source: On Enter
ar: عند الدخول

source: On Exit
ar: عند الخروج

source: Dwell Time
ar: وقت المكوث

source: Monitored Devices
ar: الأجهزة المراقبة

source: Sound
ar: الصوت

source: Vibration
ar: الاهتزاز

source: Priority
ar: الأولوية

# defaultPriority
source: Default
ar: افتراضي

source: Both
ar: كلاهما

source: Push
ar: دفع

source: Local
ar: محلي

# triggerWhenDeviceEnters
source: Trigger when device enters this area
ar: التفعيل عند دخول الجهاز إلى هذه المنطقة

# triggerWhenDeviceLeaves
source: Trigger when device leaves this area
ar: التفعيل عند خروج الجهاز من هذه المنطقة

# triggerWhenDeviceStays
source: Trigger when device stays in area
ar: التفعيل عند بقاء الجهاز في المنطقة

# monitorAllDevices
source: Monitor all devices automatically
ar: مراقبة جميع الأجهزة تلقائياً

# selectAtLeastOneDevice
source: Select at least one device or enable "All Devices"
ar: اختر جهازاً واحداً على الأقل أو فعّل "جميع الأجهزة"

source: Play notification sound
ar: تشغيل صوت الإشعار

source: Vibrate on notification
ar: الاهتزاز عند الإشعار

source: Paused
ar: متوقف مؤقتاً

source: Active
ar: نشط

source: Total
ar: الإجمالي

source: Entry
ar: دخول

source: Exit
ar: خروج

source: welcome back
ar: مرحباً بعودتك

source: Enter your account
ar: أدخل حسابك

source: Email or Username
ar: البريد الإلكتروني أو اسم المستخدم

source: Password
ar: كلمة المرور

source: login
ar: تسجيل الدخول

source: Enter email or username
ar: أدخل البريد الإلكتروني أو اسم المستخدم

source: Enter password
ar: أدخل كلمة المرور

source: Session Expired
ar: انتهت الجلسة

# pleaseEnterPasswordToContinue
source: Please enter your password to continue
ar: الرجاء إدخال كلمة المرور للمتابعة

# validatingSession
source: Validating your session...
ar: التحقق من جلستك...

source: Image not found
ar: الصورة غير موجودة

source: Geofence Settings
ar: إعدادات السياج الجغرافي

source: About Geofence Settings
ar: حول إعدادات السياج الجغرافي

source: Geofence Configuration
ar: تكوين السياج الجغرافي

# configureHowGeofencesWork
source: Configure how geofences work, including monitoring, notifications, and performance optimization.
ar: قم بتكوين كيفية عمل السياج الجغرافي، بما في ذلك المراقبة والإشعارات وتحسين الأداء.

source: Enable Geofencing
ar: تفعيل السياج الجغرافي

# turnOnToReceiveAlerts
source: Turn on to receive alerts when entering or exiting geofences
ar: قم بالتشغيل لتلقي التنبيهات عند الدخول أو الخروج من السياج الجغرافي

source: Sign in to enable geofence monitoring
ar: سجل الدخول لتفعيل مراقبة السياج الجغرافي

# backgroundGeofenceMonitoringActive
source: Background geofence monitoring and notifications are active
ar: مراقبة السياج الجغرافي والإشعارات في الخلفية نشطة

source: Background Access
ar: الوصول في الخلفية

source: Background geofence monitoring enabled
ar: مراقبة السياج الجغرافي في الخلفية مفعّلة

# disabledAppMayMissEvents
source: Disabled – app may miss events when closed
ar: معطّل – قد يفوت التطبيق الأحداث عند إغلاقه

source: ✅ Background access granted
ar: ✅ تم منح الوصول في الخلفية

source: ⚠️ Foreground-only mode activated
ar: ⚠️ تم تفعيل وضع المقدمة فقط

source: About Foreground Mode
ar: حول وضع المقدمة

# inForegroundOnlyMode
source: In foreground-only mode, geofence monitoring works only while the app is open. To receive alerts when the app is closed, enable background location access.
ar: في وضع المقدمة فقط، تعمل مراقبة السياج الجغرافي فقط أثناء فتح التطبيق. لتلقي التنبيهات عند إغلاق التطبيق، قم بتفعيل الوصول إلى الموقع في الخلفية.

source: Got it
ar: فهمت

source: Adaptive Optimization
ar: التحسين التكيفي

source: Disabled - Fixed evaluation frequency
ar: معطّل - تردد التقييم الثابت

source: Active mode
ar: الوضع النشط

source: Idle mode
ar: وضع الخمول

source: Battery saver
ar: موفر البطارية

source: interval
ar: الفاصل الزمني

source: Optimization disabled
ar: التحسين معطّل

source: ✅ Adaptive optimization enabled
ar: ✅ تم تفعيل التحسين التكيفي

source: ⏸️ Adaptive optimization disabled
ar: ⏸️ تم تعطيل التحسين التكيفي

source: ❌ Failed to start optimizer
ar: ❌ فشل بدء المحسّن

source: Optimization Statistics
ar: إحصائيات التحسين

source: Savings
ar: التوفير

source: Default Notification Type
ar: نوع الإشعار الافتراضي

source: Local only
ar: محلي فقط

source: Evaluation Frequency
ar: تردد التقييم

source: Balanced (recommended)
ar: متوازن (موصى به)

source: Reset to Defaults
ar: إعادة تعيين إلى الافتراضيات

# thisWillResetAllGeofenceSettings
source: This will reset all geofence settings to their default values. Are you sure you want to continue?
ar: سيؤدي هذا إلى إعادة تعيين جميع إعدادات السياج الجغرافي إلى قيمها الافتراضية. هل أنت متأكد أنك تريد المتابعة؟

source: Reset
ar: إعادة تعيين

source: ✅ Settings reset to defaults
ar: ✅ تم إعادة تعيين الإعدادات إلى الافتراضيات

source: ✅ Geofence monitoring started
ar: ✅ بدأت مراقبة السياج الجغرافي

source: ⏸️ Geofence monitoring stopped
ar: ⏸️ توقفت مراقبة السياج الجغرافي

source: ❌ Failed to start monitoring
ar: ❌ فشل بدء المراقبة

source: ❌ Failed to stop monitoring
ar: ❌ فشل إيقاف المراقبة

source: Select Notification Type
ar: حدد نوع الإشعار

source: Show notifications only on this device
ar: إظهار الإشعارات على هذا الجهاز فقط

source: Push only
ar: دفع فقط

# sendPushNotificationsViaServer
source: Send push notifications via server (requires network)
ar: إرسال إشعارات الدفع عبر الخادم (يتطلب شبكة)

source: Both (Local + Push)
ar: كلاهما (محلي + دفع)

source: Send both local and push notifications
ar: إرسال الإشعارات المحلية والدفع

source: Silent
ar: صامت

source: No notifications (events still logged)
ar: لا توجد إشعارات (لا تزال الأحداث مسجلة)

source: Notification type set to
ar: تم تعيين نوع الإشعار إلى

source: Select Evaluation Frequency
ar: حدد تردد التقييم

source: Fast (Real-time)
ar: سريع (وقت حقيقي)

source: Check every 5-10s (high battery usage)
ar: التحقق كل 5-10 ثانية (استهلاك عالٍ للبطارية)

source: Check every 30s (moderate battery usage)
ar: التحقق كل 30 ثانية (استهلاك معتدل للبطارية)

# batterySaverMode
source: Battery Saver
ar: وضع توفير البطارية

source: Check every 60-120s (low battery usage)
ar: التحقق كل 60-120 ثانية (استهلاك منخفض للبطارية)

source: Evaluation frequency set to
ar: تم تعيين تردد التقييم إلى

# controlsTheMainGeofenceMonitoringService
source: Controls the main geofence monitoring service. When disabled, no geofence events will be detected.
ar: يتحكم في خدمة مراقبة السياج الجغرافي الرئيسية. عند التعطيل، لن يتم الكشف عن أحداث السياج الجغرافي.

# allowsTheAppToDetectGeofenceEvents
source: Allows the app to detect geofence events even when closed. Without this permission, monitoring only works while app is open.
ar: يسمح للتطبيق باكتشاف أحداث السياج الجغرافي حتى عند إغلاقه. بدون هذا الإذن، تعمل المراقبة فقط أثناء فتح التطبيق.

# automaticallyAdjustsGeofenceCheckFrequency
source: Automatically adjusts geofence check frequency based on battery level and device motion to save power.
ar: يضبط تلقائيًا تردد فحص السياج الجغرافي بناءً على مستوى البطارية وحركة الجهاز لتوفير الطاقة.

# chooseHowYouWantToBeNotified
source: Choose how you want to be notified about geofence events. Local notifications work offline, push requires network.
ar: اختر كيف تريد أن يتم إعلامك بأحداث السياج الجغرافي. الإشعارات المحلية تعمل بدون اتصال، الإشعارات الدفع تتطلب شبكة.

# howOftenTheAppChecks
source: How often the app checks if devices are inside geofences. Higher frequency = more battery usage but faster detection.
ar: عدد المرات التي يتحقق فيها التطبيق من وجود الأجهزة داخل السياج الجغرافي. تردد أعلى = استهلاك أكبر للبطارية ولكن اكتشاف أسرع.
